---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.TextLabelType
source: html/f7968a9e-6a5c-c190-6136-8a434df474e5.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.TextLabelType Property

Type of diagram text label visualization.

## Syntax (C#)
```csharp
public AnalysisDisplayStyleDiagramTextLabelType TextLabelType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration